Revit 2027 API
Stairs.BaseElevation Property
 The base elevation of the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BaseElevation { get; }
Public ReadOnly Property BaseElevation As Double
	Get
public:
property double BaseElevation {
	double get ();
}
member BaseElevation : float with get
Property Value
Double
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace